# Housing Market

### Introduction:

This time we will create our own dataset with fictional numbers to describe a house market. As we are going to create random data don't try to reason of the numbers.

### Step 1. Import the necessary libraries

In [1]:
import pandas as pd
import numpy as np

### Step 2. Create 3 differents Series, each of length 100, as follows: 
1. The first a random number from 1 to 4 
2. The second a random number from 1 to 3
3. The third a random number from 10,000 to 30,000

In [2]:
s1 = pd.Series(np.random.randint(1, high = 5, size = 100, dtype = 'l'))
s2 = pd.Series(np.random.randint(1, high = 4, size = 100, dtype = 'l'))
s3 = pd.Series(np.random.randint(10000, high = 30000, size = 100, dtype = 'l'))

### Step 3. Let's create a DataFrame by joinning the Series by column

In [3]:
housemkt = pd.concat([s1, s2, s3], axis=1)
housemkt.head()

   0  1      2
0  3  2  21304
1  3  2  25072
2  3  2  14843
3  3  2  20390
4  1  2  21771

### Step 4. Change the name of the columns to bedrs, bathrs, price_sqr_meter

In [5]:
housemkt.rename(columns = {0: 'bedrs', 1: 'bathrs', 2: 'price_sqr_meter'}, inplace=True)
housemkt.head()

   bedrs  bathrs  price_sqr_meter
0      3       2            21304
1      3       2            25072
2      3       2            14843
3      3       2            20390
4      1       2            21771

### Step 5. Create a one column DataFrame with the values of the 3 Series and assign it to 'bigcolumn'

In [7]:
bigcolumn = pd.concat([s1, s2, s3], axis = 0)
bigcolumn = bigcolumn.to_frame()

print(type(bigcolumn))
bigcolumn

<class 'pandas.core.frame.DataFrame'>

        0
0       3
1       3
2       3
3       3
4       1
..    ...
95  29698
96  22059
97  12633
98  17225
99  10337

[300 rows x 1 columns]

### Step 6. Oops, it seems it is going only until index 99. Is it true?

In [8]:
bigcolumn.shape

(300, 1)

### Step 7. Reindex the DataFrame so it goes from 0 to 299

In [ ]:
bigcolumn.reset_index(drop = True, inplace=True)